
## Plan Result (prod)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
  * azurerm_key_vault_secret.exela_supplier_subscription_key
  * azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key
  * azurerm_key_vault_secret.iron_mountain_supplier_subscription_key
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.exela_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Bulk Scanning Payment API - Exela Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Bulk Scanning Payment API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Bulk Scanning Payment API - Iron Mountain Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.exela_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "exela_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "exela-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_bulk_scan_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "fee-pay-team-bulk-scan-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.iron_mountain_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "iron_mountain_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "iron-mountain-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Bulk Scanning Payment API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "bulk-scanning-payment-api"
      + path                  = "bulk-scanning-payment"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "1"
      + service_url           = "http://ccpay-bulkscanning-api-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/ccpay-payment-app.bulk-scanning.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scanning-payment-api"
      + id                  = (known after apply)
      + product_id          = "bulk-scanning-payment"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scanning-payment-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;A78ED211FD9CE9DE2EEC47FD1A87F40CE0F4A1A5&quot;,&quot;F4A976E4967F8F4F621C87C67B9E258563F80F0E&quot;,&quot;B35BCF6C5C9DAEE7D0C756B666FFEDE2CF4659BA&quot;,&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;E4E5673792DA616E14BEEF63F75DD96590124734&quot;,&quot;3FEBC1DE5DFBAF97B1F1CEEC80A1B192F999596A&quot;,&quot;CC852B5D1349041E1309AC5F9918ECE1FE5C023C&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="403" reason="Invalid client certificate."/>
                    </return-response>
                  </when>
                </choose>
                <!-- generate totp -->
                <set-variable name="client_id" value="api_gw" />
                <set-variable name="client_secret" value="JBSAAHPPEHPK3PXP" />
                <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                            var bits = &quot;JBSAAHPPEHPK3PXP&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] &amp; 0xf;
                            int truncatedHash = hash[offset] &amp; 0x7f;
                            for (int i = 1; i &lt; 4; i++)
                            {
                                truncatedHash &lt;&lt;= 8;
                                truncatedHash |= hash[offset + i] &amp; 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString(&quot;D6&quot;);
                        }"/>
                <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                  <set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
                  <set-method>POST</set-method>
                  <set-header name="Content-Type" exists-action="override">
                    <value>application/json</value>
                  </set-header>
                  <set-body>@{
                    return new JObject(
                    new JProperty("microservice", (string)context.Variables["client_id"]),
                    new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                    ).ToString();
                    }</set-body>
                </send-request>
            
                <set-header name="ServiceAuthorization" exists-action="override">
                  <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
                </set-header>
              </inbound>
              <outbound>
                <base/>
              </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = true
      + display_name          = "bulk-scanning-payment"
      + id                    = (known after apply)
      + product_id            = "bulk-scanning-payment"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":552,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->